<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"3e455687b9326ee3dc66a33040fe39e92d51154d37e26f7dabf9573d243337d8","plan_job_ref":"Job Write Terraform Plan to Pull Request #31 at https://github.com/hackforla/devops-security/actions/runs/7998788944","plan_out_hash":"477bb40bb4ef9b76828eaf76a3281a1879efa3757f4dd79175f2d37734ef1d30","plan_hash":"7611fa37b9ca5c25fd95e3dd16612546347bb3d492ef9c13303aaff16349642f","plan_text_format":"diff","version":"1.41.2"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 2 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws_custom_policies.aws_iam_policy.custom_policy["IAMServicesAdmin"] is tainted, so must be replaced
-/+ resource "aws_iam_policy" "custom_policy" {
!~      arn         = "arn:aws:iam::035866691871:policy/IAMServicesAdmin" -> (known after apply)
!~      id          = "*************************************************" -> (known after apply)
        name        = "IAMServicesAdmin"
+       name_prefix = (known after apply)
!~      policy_id   = "*********************" -> (known after apply)
-       tags        = {} -> null
!~      tags_all    = {} -> (known after apply)
#        (3 unchanged attributes hidden)
    }

  # module.iam_services_admin_group.aws_iam_group_policy_attachment.group_policy_attachment["IAMServicesAdmin"] will be created
+   resource "aws_iam_group_policy_attachment" "group_policy_attachment" {
+       group      = "iam-services-admin-group"
+       id         = (known after apply)
+       policy_arn = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Write Terraform Plan to Pull Request #31](https://github.com/hackforla/devops-security/actions/runs/7998788944)